constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet1
    {
        type            patch;
        nFaces          90;
        startFace       39575;
    }
    outlet1
    {
        type            patch;
        nFaces          90;
        startFace       39665;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          15;
        startFace       39755;
    }
    top
    {
        type            patch;
        nFaces          150;
        startFace       39770;
    }
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          505;
        startFace       39920;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40000;
        startFace       40425;
    }
)

// ************************************************************************* //
