system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (-15 0 0) // 0
    (15 0 0)
    (30 1.998763 0)
    (45 6.21809272 0)
    (62 11 0)
    (90 11 0) // 5
    (90 20.43002552 0)
    (66 20.43002552 0)
    (52 18.43002552 0)
    (69 24.43002552 0)
    (90 24.43002552 0) // 10
    (90 60 0) 
    (69 60 0)
    (52 60 0)
    (30 60 0)
    (15 60 0) // 15
    (-15 60 0)
    (-15 15 0)
    (15 15 0)
    (30 16.5 0) 
    (-15 0 1) // 20
    (15 0 1)
    (30 1.998763 1)
    (45 6.21809272 1)
    (62 11 1)
    (90 11 1) // 25
    (90 20.43002552 1)
    (66 20.43002552 1)
    (52 18.43002552 1)
    (69 24.43002552 1)
    (90 24.43002552 1) // 30
    (90 60 1) 
    (69 60 1)
    (52 60 1)
    (30 60 1)
    (15 60 1) // 35
    (-15 60 1)
    (-15 15 1)
    (15 15 1)
    (30 16.5 1) 

);

blocks
(
    hex (0 1 18 17 20 21 38 37) (15 50 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .25)) 1) // 1 bottom 
    hex (1 2 19 18 21 22 39 38) (30 50 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .25)) 1) // 2
    hex (2 3 8 19 22 23 28 39) (50 50 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .25)) 1) // 3
    hex (3 4 7 8 23 24 27 28) (65 50 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .25)) 1) // 4
    hex (4 5 6 7 24 25 26 27) (120 50 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .25)) 1) // 5 
    hex (17 18 15 16 37 38 35 36) (15 40 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .5)) 1) // 6 top
    hex (18 19 14 15 38 39 34 35) (30 40 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .5)) 1) // 7
    hex (19 8 13 14 39 28 33 34) (50 40 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .5)) 1) // 8
    hex (8 9 12 13 28 29 32 33) (40 40 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .5)) 1) // 9
    hex (9 10 11 12 29 30 31 32) (15 40 1) simpleGrading (1 ((.5 .5 4) (.5 .5 .5)) 1) // 10
);

edges
(
);

boundary
(
    inlet1
    {
        type patch;
        faces
        (
            (0 20 37 17)
            (17 37 36 16)
        );
    }
    
    
    outlet1 
    {
        type patch;
        faces
        (
            (5 6 26 25)
            (10 11 31 30)
        );
    }
    
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 21 20)
        );
    }



    top
    {
        type patch;
        faces
        (
            (16 36 35 15)
            (15 35 34 14)
            (14 34 33 13)
            (13 33 32 12)
            (12 32 31 11)
        );
    }

    wall1
    {
        type wall;
        faces
        (
            (1 2 22 21)
            (2 3 23 22)
            (3 4 24 23)
            (4 5 25 24)
            (6 7 27 26)
            (7 8 28 27)
            (8 9 29 28)
            (9 10 30 29)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
